[
	{
		"slug": "artful-fox",
		"name": "Artful Fox Creatives",
		"summary":"Artful Fox Creatives is a collaboration between an author and an illustrator who just happen to be award winning primary science teachers.",
		"my_role": "Artfulfox Creatives focuses on producing picture books for kids in primary schools. Their books have beautiful art and characters that I wanted to showcase in the design by using their hand-drawn images. In the background, I've used custom SCSS to bring their visual ideas to life. Also integrated the Contentful CMS, for content management as they are planning to publish more books in the future, change prizes, add additional downloadable handbooks and information. They needed a way for customers to contact for any inquiries from the page, therefore I've used Sendgrid and leveraged Netlify's serverless functions to connect everything! Currently, they are only selling through Amazon, but we already started to implement Stripe as a payment gateway, so customers will be able to purchase books directly from them!",
		"images" : ["artful_1", "artful_2", "artful_3"], 
    "image_src" : "artful_preview.webp",
    "git": "", 
		"url": "https://www.artfulfoxcreatives.com"
	},
  {
    "slug": "drinsed-laundry",
    "name": "Drinsed",
    "summary": "Drinsed is an UK based company who collects,cleans and delivers laundry directly to your door.",
    "my_role": "My main role was to implement the client's design and turn it into a modern and fast web application. On the back-end it uses Rails and for the database they used SQL. Fortunately, I could choose my tools to build the frontend, therefore I've used Vue.js. One of the biggest challenges regarding this project was to learn how a Rails application works and reverse engineer that. For hosting, we decided on AWS Amplify, because the backend was already hosted on AWS and they made it super easy to host a Single Page Application. For the payment it uses Stripe.js, state management is handled with Vuex and routing with vue-router. All in all, it was a fun project and I've learned a lot during development.",
    "images": [
      "drinsed_1",
      "drinsed_2",
      "drinsed_3"
    ],
    "image_src" : "drinsed_preview.webp",
    "git": "https://github.com/olaszm/drinsed-laundry",
    "url": ""
  },
  {
    "slug": "david-lizom-portfolio",
    "name": "David Lizom motion designer",
    "summary": "David Lizom is a talented freelance Illustrator and Motiond Designer from Hungary. He needed an online portfolio to boost his freelancing career as an Illustrator & Motion Designer.",
    "my_role": "We worked together on the design and thanks to Figma's collaboration function I learned a lot about how to work closely with someone who has experience in design.He needed internationalization to reach both Hungarian and English speaking costumers. I'm a big fan of Vue.js so I knew vue-i18n will be the perfect solution for this problem. He also wanted people to reach him using a contact form on his website. For this initially, I wanted to use SendGrid, but unfortunately, He already paid for a hosting platform for a year, so we ended up using PHP for the form submit. Transitions were made with GSAP and Vue Transitions. Eventually, he's going to extend with a gallery and some case studies where I'm planning to use Contentful as a CMS.  ",
    "images": [
      "lizom_1",
      "lizom_2",
      "lizom_3"
    ],
    "image_src" : "lizom_preview.webp",
    "git": "https://github.com/olaszm/lizom_portfolio",
    "url": "https://davidlizom.com/"
  },
  {
		"slug": "onitama-clone",
		"name": "Onitama Clone",
		"summary":"Onimata is a Japanase stategy board game that inspired me to make a web based clone",
		"my_role": "Built with Typescript, React, MUI, Figma",
		"images" : [""], 
    "image_src" : "onitama_preview.webp",
    "git": "https://github.com/olaszm/onitama-clone", 
		"url": "https://onitama-clone-om.netlify.app/"
	},
  {
    "slug": "personal-portfolio",
    "name": "Personal Portfolio",
    "summary": "This is my personal online portfolio with some interactive elements.",
    "my_role": "I've designed and coded this website entirely. I do love minimalist design, but this time I felt like something is missing, so I tried to integrate a few interactive elements that can grab the user's attention. I've gone through www.awwwards.com for some inspiration and tried to break down and tweak other people's creative solutions. ",
    "images": [
      "me_1",
      "me_2",
      "me_3"
    ],
    "image_src" : "me_preview.webp",
    "git": "https://github.com/olaszm/personal-portfolio",
    "url": "https://martinolasz.dev/"
  }
]
